using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConverterProject
{
    public class Csv
    {
        string[] fields = {
                "Код_товара"
                ,"Название_позиции"
                ,"Название_позиции_укр"
                ,"Поисковые_запросы"
                ,"Поисковые_запросы_укр"
                ,"Описание","Описание_укр"
                ,"Тип_товара"
                ,"Цена"
                ,"Валюта"
                ,"Единица_измерения"
                ,"Минимальный_объем_заказа"
                ,"Оптовая_цена"
                ,"Минимальный_заказ_опт"
                ,"Ссылка_изображения"
                ,"Наличие"
                ,"Количество"
                ,"Номер_группы"
                ,"Название_группы"
                ,"Адрес_подраздела"
                ,"Возможность_поставки"
                ,"Срок_поставки"
                ,"Способ_упаковки"
                ,"Способ_упаковки_укр"
                ,"Уникальный_идентификатор"
                ,"Идентификатор_товара"
                ,"Идентификатор_подраздела"
                ,"Идентификатор_группы"
                ,"Производитель"
                ,"Страна_производитель"
                ,"Скидка"
                ,"ID_группы_разновидностей"
                ,"Личные_заметки"
                ,"Продукт_на_сайте"
                ,"Cрок действия скидки от"
                ,"Cрок действия скидки до"
                ,"Цена от"
                ,"Ярлык"
                ,"HTML_заголовок"
                ,"HTML_заголовок_укр"
                ,"HTML_описание"
                ,"HTML_описание_укр"
                ,"HTML_ключевые_слова"
                ,"HTML_ключевые_слова_укр"
                ,"Вес,кг"
                ,"Ширина,см"
                ,"Высота,см"
                ,"Длина,см"
                ,"Где_находится_товар"
                ,"Код_маркировки_(GTIN)"
                ,"Номер_устройства_(MPN)"
                ,"Название_Характеристики"
                ,"Измерение_Характеристики"
                ,"Значение_Характеристики"
        };
    }
}
